#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

          - "3c49d426-471a-424b-a176-1c63035e0c0e",
          - "3c8efdf6-e83f-45c5-ae6c-81fa4231cef1",
          - "4386dcb7-036e-4b45-bec9-e60d7b963bf9",
          - "43fcffe7-7400-425f-8316-37411e19d241",
          - "451f3ec6-596d-4516-ba6a-8dfee68c4330",
          - "4862be46-3e88-4d7b-b953-725e000ffa9b",
          - "4b35a0d7-7c87-476d-914f-010bfff80d50",
          - "4b554dbe-6f89-4798-824b-d2e290595f92",
          - "50cd8bcf-0a61-41f3-b20e-d1f54b17f42d",
          - "55179234-d6b5-4549-9e21-159bc9800425",
          - "56d949fc-61f7-4b90-b862-61ee6fd73685",
          - "59d37a85-0b3a-4c89-93c5-c8b97a53f55d",
          - "5cc84520-6e48-4545-bec5-f47642187592",
          - "5f998ee4-6cc5-46f4-909c-32dd02bd6ae0",
          - "616c7534-19bb-4f56-b3ba-1eab1a47b7cb",
          - "6659f5d3-e1cd-48e2-ac11-f8ecc1e8061f",
          - "68933fe3-7eb8-44d8-b020-beeb54fade3d",
          - "6a237c0b-cf0e-4901-8508-72cb6732f851",
          - "6ea6b310-5848-4d7d-a34b-a74784d7783a",
          - "7032f402-7431-4510-90e7-e7e21a33b253",
          - "77549ee3-e29e-41cc-b653-f5f0d5f417ed",
          - "77ff9438-82c5-4fa9-be29-b03c90dc2c0b",
          - "84222c92-8abf-4021-abea-047cd461ae21",
          - "84fbd6c2-8895-4fb4-8eaa-a7cf31c22356",
          - "8b965628-f076-4abc-80c4-5d85d01c86b7",
          - "8bea7469-b2b6-4799-b914-91ee2221a15a",
          - "8d594783-7d0a-425b-8e48-56b14f9e5989",
          - "9130f6c7-1d49-4f21-8a18-0db979ca1eb6",
          - "91d9434c-b2cc-49a9-af56-4ac20d35477b",
          - "937d5694-5b99-430e-9942-d776f89d9204",
          - "97ff8eb9-f5e0-4b09-88c1-bccb468f8376",
          - "9e9b4f7d-170d-419e-b8e2-befec04eea38",
          - "a49c93c3-6bf3-4e8a-8b90-dff7e1f40151",
          - "b469bb7c-d9c4-4dd5-8bbc-6ed04544dc2d",
          - "bbc647ad-b839-4926-8bae-43ea03fd23b7",
          - "bc49c66e-fd42-4d7d-b27c-a04069aa35e7",
          - "bdb5bc52-c1da-4133-aeda-af4faffc6883",
          - "c0f74dc3-3b22-4df6-9338-970aa647d3a5",
          - "c17c7bec-1945-45fc-a294-5c59a05afd30",
          - "c3d6dfac-e10e-4275-9df3-e3da92476b14",
          - "c56e095a-db49-4426-9391-e3fb07945840",
          - "cc8e2983-2eee-4f21-b47e-4953d272a4fd",
          - "cda7bc35-a61c-4822-b0cb-0c45ebe626cc",
          - "d5086c42-6157-4da9-89cd-54721ab9e97d",
          - "db8e9223-4a9e-4700-bbd9-2f7ac047790a",
          - "dc4020f7-1ffa-4515-8277-26466c54511c",
          - "e7a9e3ab-ceba-4d37-b012-6d6eb704338f",
          - "e84a64e6-d5ce-42dd-b909-45e0e288e4ce",
          - "eb01481d-6254-4a97-b4d0-d6d7bf80786f",
          - "ec7a4e67-0f64-4bbb-9b40-a958c3749a5a",
          - "ed338f74-8be6-405d-84eb-fe4f2abf5794",
          - "f6b97e6c-5b6c-4a35-87e2-0373e4a09846",
          - "f6f7b4dc-dcf4-4cae-be1e-9b8ac4f3a21e",
          - "f8778dbf-d583-41f0-8208-99ebc9567ad7",
          - "fccb6849-0a77-406f-b92a-d67b7caed353",
        ] -> (known after apply)
        id              = "b559cd58-395b-4341-b862-d1105aca50c9"
        name            = "Manage Users"
        # (3 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.HEALTH-IDEAS.module.client-roles.keycloak_role.ROLES["REPORTS_ADMIN_DEV"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "REPORTS_ADMIN_DEV"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.HEALTH-IDEAS.module.client-roles.keycloak_role.ROLES["REPORTS_ADMIN_UAT"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "REPORTS_ADMIN_UAT"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-health-ideas"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "cc4d80a5-4a1c-4d80-a2c3-59d3ebde880d"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-health-ideas"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "ab6e0d99-9205-4625-8ea4-88835ddd36ae"
      + id        = (known after apply)
      + name      = "view-client-health-ideas"
      + realm_id  = "moh_applications"
    }

Plan: 9 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*